import { cyrodiilAndBattlegroundText } from "../lib-sets-drop-tip-shared-text/lib-sets-drop-tip-shared-text.module.code.ts"

export const RU = {
  [LIBSETS_DROP_MECHANIC_MAIL_PVP_REWARDS_FOR_THE_WORTHY]:
    "Награда достойным (" +
    cyrodiilAndBattlegroundText +
    " почта) - Содержит только новейшие наборы предметов!\nПо мере добавления новых наборов старые наборы будут удалены отсюда и добавлены в другие источники Сиродила:\nВсе наборы PvP-предметов теперь будут выпадать из подземелий, дольменов и миссий на доске Сиродила.\nГородские ежедневные задания и торговцы будут разделены по Свету. , средний и тяжелый. Исключение: Чейдинхол и Приорат Коррола/Вейнона дают награду за любой набор.\nВсе PvP-наборы доступны в виде отдельных контейнеров как у городских торговцев, так и у продавцов элитного снаряжения.\nВ Дельвах из комплектов предметов для талии и ног выпадут все.\nИз дольменов выпадут драгоценности.\nИз настольных миссий выпадут все. другие части доспехов.\nЗа миссии Bounty и Scout будут выдаваться части доспехов.\nЗа миссии Battle and Warfront будут выдаваться части слотов для оружия.",
  [LIBSETS_DROP_MECHANIC_OVERLAND_BOSS_DELVE]:
    "Боссы вылазок дают шанс выпадания талии или голени.",
  [LIBSETS_DROP_MECHANIC_OVERLAND_WORLDBOSS]:
    "Групповые боссы дают 100% шанс выпадания головы, груди, ног или оружия.",
  [LIBSETS_DROP_MECHANIC_OVERLAND_BOSS_PUBLIC_DUNGEON]:
    "Боссы открытых подземелий дают шанс выпадания плечей, рук или оружия.",
  [LIBSETS_DROP_MECHANIC_OVERLAND_CHEST]:
    "Сундуки, полученные после побед над Тёмными якорями, имеют 100% шанс выпадания кольца или амулета.\nСундуки сокровищ, найденные в мире, дают шанс получить любую часть комплекта, выпадающую в этой зоне:\n- простые сундуки дают незначительный шанс\n- средние сундуки дают хороший шанс\n- продвинутые и мастерские сундуки дают гарантированный шанс\n- сундуки сокровищ, найденные по Карте сокровищ, дают гарантированный шанс",
  [LIBSETS_DROP_MECHANIC_TELVAR_EQUIPMENT_LOCKBOX_MERCHANT]:
    "Сундук, который можно обменять на камни ТелВар у продавца оборудования ТелВар на базе вашей фракции в канализации Имперского города",
  [LIBSETS_DROP_MECHANIC_TRIAL_BOSS]:
    "Все боссы: Руки, Поясница, Ноги, Грудь, Плечо, Голова, Ноги\nФинальные боссы: Оружие, Щит\nКонтейнеры с наградами за квест: Ювелирные изделия, Оружие, Щит (привязывается при получении))",
}
